Revit 2027 API
FabricationServiceButton.IsValid Method
 Checks if the button contains only valid fittings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValid()
Public Function IsValid As Boolean
public:
bool IsValid()
member IsValid : unit -> bool
Return Value
Boolean
 True if the button contains only valid fittings.
See Also
Reference
FabricationServiceButton Class
Autodesk.Revit.DB Namespace